import random


question = ''
options = []
correct_option_id = 0

allsogl = (["б", "п", "м", "в", "ф", "д", "т", "з", "с", "ц", "н", "л", "ж", "ш",
            "р", "г", "к", "х", "γ", "б'", "п'", "м'", "в'", "ф'", "д'", "т'", "з'",
            "с'", "н'", "л'", "р'", "г'", "к'", "х'", "γ'", "j"])
sogl = {"Способ артикуляции": {"Смычный": ["б", "б'", "п", "п'", "д", "д'", "т", "т'", "г", "г'", "к", "к'"],
                               "Щелевой": ["в", "в'", "ф", "ф'", "з", "з'", "с", "с'", "ж", "ш", "j", "х", "х'", "γ", "γ'"],
                               "Смычно-щелевой": ["ц", "ч'"],
                               "Носовой": ["м" "м'" "н" "н'" ],
                               "Боковой": ["л", "л'"],
                               "Дрожащий": ["р", "р'"]},
        "Место артикуляции":{"Губно-губной": ["б", "б'", "п", "п'", "м", "м'"],
                             "Губно-зубной": ["в", "в'", "ф", "ф'"],
                             "Зубной": ["д", "д'", "т", "т'", "з", "з'", "с", "с'", "ц", "н", "н'", "л", "л'"],
                             "Передненёбный": ["ж", "ш", "ч'", "р", "р'"],
                             "Среднеязычный": ["j"],
                             "Заднеязычный": ["г", "г'", "к", "к'", "х", "х'", "γ", "γ'"]},
        "Звонкость": {"Звонкий": ["б", "б'", "д", "д'", "г", "г'", "в", "в'", "з", "з'", "ж", "j", "γ", "γ'"],
                      "Глухой": ["п", "п'", "т", "т'", "к", "к'", "ф", "ф'", "с", "с'", "ш", "х", "х'", "ц", "ч'"],
                      "Сонорный": ["м", "м'", "н", "н'", "л", "л'", "р", "р'"]},
        "Палатализация": {"Твёрдый": ["б", "п", "м", "в", "ф", "д", "т", "з", "с", "ц", "н", "л", "ж", "ш", "р", "г", "к", "х", "γ"],
                          "Мягкий": ["б'", "п'", "м'", "в'", "ф'", "д'", "т'", "з'", "с'", "н'", "л'", "р'", "г'", "к'", "х'", "γ'"],
                          "Палатальный": ["j"]}}





def poll():
    options = random.sample(allsogl, 5)
    target = random.choice(options)
    correct_option_id = options.index(target)
    question = "Какой из этих звуков "

    for x in sogl.values():
        for dct in x.items():
            if target in dct[1]:
                question += dct[0] + ', '

    question = question[:-2] + '?'
    
    return options, correct_option_id, question
